# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
#  В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример:*
# 5
#     1 2 3 4 5
#     3
#     -> 1

N = int(input('Введите количество элементов в массиве: '))
list_1 = []

for i in range(N):
    b = int(input())
    list_1.append(b)
    print(str(list_1))

x = int(input('Введите число x: '))

coin = 0
for i in range(len(list_1)):
    if list_1[i] == x:
        coin += 1

print(int(coin))
